//NEWHIRE  JOB(blah),
//             CLASS=T,MSGCLASS=Y,
//             NOTIFY=&SYSUID
//EMPLOAD EXEC PGM=LOADEMPL
//SYSOUT    DD SYSOUT=* 
//EMPLIN	 DD DSN=SYS3.HRPROD.NEWHIRES,
//             DISP=SHR 
//EMPLVALD  DD DSN=SYS3.HRPROD.OKHIRES,
//             DISP=(NEW,CATLG,DELETE)
//EMPLERR   DD DSN=SYS3.HRPROD.BADRECS,
//             DISP=(NEW,CATLG,CATLG)